{
    "projects": [
        {
            "title": "Portfolio",
            "bodyText": "- Developer Portfolio Website made in React.\n -  Fully customisable and dynamic, easily change data and images.\n - Dark Mode Support",
            "tags": [
                "React",
                "Portfolio",
                "JavaScript"
            ]
        },
        {
            "title": "Preschool Registration Automation",
            "bodyText": "- The system has been developed using MS SQL, .NET Core, and MVC technologies for a desktop kindergarten registration application.\n - The database connection is established using Entity Framework, and the DB First approach has been adopted in the Data layer, with automatic entity and context classes generated through scaffolding.\n - Role-based authorization mechanisms have been implemented for admin, teacher, and student roles, ensuring clear definition of user access boundaries.",
            "tags": [
                "C#",
                ".NET ",
                "MVC",
                "MSSQL"
            ]
        },
        {
            "title": "Cryptography Algorithm",
            "bodyText": "- Encryption operations were performed using RSA, DES, and AES algorithms with cryptography libraries in C#. \n - During this process, the encryption times and performance of each algorithm were compared in detail.\n - The analysis evaluated the algorithms in terms of processing time, security level, and efficiency, determining the most suitable encryption solution.",
            "tags": [
                "C#",
                "RSA",
                "DES",
                "AES",
                "Encryption",
                "Decryption",
                "CryptographyLibraries"
            ]
        },
        {
            "title": "Python Django",
            "bodyText": "- An Android App that allows users to send texts in real time.\n - End to End encryption using **RSA** Algorithm.\n - Uses **Firebase** database to store texts.\n - Secured with **Fingerprint** lock.",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/mayankagarwal09/SecureChatApp"
                }
            ],
            "tags": [
                "Python",
                "Django"
            ]
        },
        {
            "title": "In-house Project: React Native Mobile Application",
            "bodyText": "- Contribute to the mobile application development process using React Native in the company's internal project. \n - Participate in project analysis and design phases, create screen designs, and directly write the frontend code for these screens.",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/mayankagarwal09/mvvm-sample-app"
                }
            ],
            "tags": [
                "React Native",
                "JavaScript",
                "TypeScript",
                "Node.js"
            ]
        },
        {
            "title": "GETİR Web Clone ",
            "bodyText": "- A clone of the Getir website's homepage was created using React.",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/mayankagarwal09/Paginated-App-Feeds-List"
                }
            ],
            "tags": [
                "React",
                "JavaScript"
            ]
        }
    ]
}